---
type: FailureDefinitionRegistry
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# FailureDefinitionRegistry

`Autodesk.Revit.DB.FailureDefinitionRegistry` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | FindFailureDefinition | 2011 | `public FailureDefinitionAccessor FindFailureDefinition ( FailureDefinitionId id )` |
| Method | ListAllFailureDefinitions | 2011 | `public IList < FailureDefinitionAccessor > ListAllFailureDefinitions ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |